# Viewport Set View Anchor And Position Method

Source: https://www.revitapidocs.com/2026/d4ad4603-33b8-2c4f-b7e5-2c012a80d932.htm

---

| Viewport Set View Anchor And Position Method |
| --- |

Sets the ViewAnchor and position to Viewport.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public void SetViewAnchorAndPosition(
	ViewAnchor viewAnchor,
	XYZ position
)
```

```
Public Sub SetViewAnchorAndPosition (
	viewAnchor As ViewAnchor,
	position As XYZ
)
```

```
public:
void SetViewAnchorAndPosition(
	ViewAnchor viewAnchor,
	XYZ^ position
)
```

```
member SetViewAnchorAndPosition :
        viewAnchor : ViewAnchor *
        position : XYZ -> unit
```

#### Parameters

viewAnchor ViewAnchor
:   The viewAnchor to be assigned.

position XYZ
:   The position to be assigned.

Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | The given value of viewAnchor cannot be applied to this Viewport. |
| ArgumentNullException | A non\-optional argument was null |
| ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

See Also

#### Reference

Viewport Class Autodesk.Revit.DB Namespace